# Пользователь вводит число N и строку.
# Выведите на экран эту строку, записанную N раз подряд.

n = int(input("Введите число: "))
line = input("Введите строку: ")
print(line*n)